frontend/modules/main/controllers/DefaultController.php

SELECT * FROM `advert` `ad` RIGHT JOIN `user` `u` ON u.id=ad.fk_agent ORDER BY `idadvert` DESC LIMIT 15
---
    public function actionIndex()
    {
        $query_advert = (new Query())->from(['ad' => 'advert'])->rightJoin(['u' =>'user'], 'u.id=ad.fk_agent')->orderBy('idadvert desc');
        $command = $query_advert->limit(5);
        $result_general = $command->all();
        $count_general = $command->count();

        $featured = $query_advert->limit(15)->all();