frontend/modules/cabinet/controllers/AdvertController.php

UPDATE `advert` SET `general_image`='general.jpg', `updated_at`=1622034304 WHERE `idadvert`=124
---
  public function actionFileUploadGeneral()
  {
    if (Yii::$app->request->isPost) {
      $id = Yii::$app->request->post("advert_id");
      $path = Yii::getAlias("@frontend/web/uploads/adverts/".$id."/general");
      BaseFileHelper::createDirectory($path);
      $model = Advert::findOne($id);
      $model->scenario = 'step2';

      $file = UploadedFile::getInstance($model,'general_image');
      $name = 'general.'.$file->extension;
      $file->saveAs($path .DIRECTORY_SEPARATOR .$name);

INSERT INTO `advert` (`price`, `address`, `bedroom`, `livingroom`, `parking`, `kitchen`, `description`, `location`, `hot`, `sold`, `type`, `recommend`, `fk_agent`, `created_at`, `updated_at`) VALUES (100000, '2', 3, 4, 5, 6, '7', '8', 1, 1, '0', 1, 23, 1622034237, 1622034237)
---
  public function actionCreate()
  {
      $model = new Advert();

      if ($model->load(Yii::$app->request->post()) && $model->save()) {

SELECT * FROM `advert` WHERE `idadvert`=124
UPDATE `advert` SET `price`=100000, `bedroom`=3, `livingroom`=4, `parking`=5, `kitchen`=6, `hot`=1, `sold`=1, `recommend`=1, `updated_at`=1622034297 WHERE `idadvert`=124
---
  public function actionUpdate($id)
  {
      $model = $this->findModel($id);

      if ($model->load(Yii::$app->request->post()) && $model->save()) {
          return $this->redirect(['step2']);//['view', 'id' => $model->idadvert]);