frontend/modules/cabinet/controllers/DefaultController.php

SELECT * FROM `user` WHERE `id`=23
---
  public function actionSettings()
  {
    $model = User::findOne(\Yii::$app->user->id);