common/models/User.php

    public static function findIdentity($id)
    {
        return static::findOne(['id' => $id, 'status' => self::STATUS_ACTIVE]);
---
SELECT * FROM `user` WHERE (`id`=23) AND (`status`=10)