frontend/models/ChangePasswordForm.php

SELECT * FROM `user` WHERE `id`=23
UPDATE `user` SET `password_hash`='$2y$13$goDJTt/yP08vKuUe7dU0Bu8BNypl/M1W4F7306XQ5gRrtQ7SmOq2S' WHERE `id`=23
---
  public function changepassword()
  {
    if ($this->validate()) {
      $user = User::findOne(\Yii::$app->user->id);
      $user->setPassword($this->password);
      $user->save(true, ['password_hash']);