frontend/widgets/HotWidget.php

  public function run()
  {
    $query = $this->_query;
    $result = $query->from('advert')->where('hot=1')->limit(5)->all();
---
SELECT * FROM `advert` WHERE hot=1 LIMIT 5